1s/ERP/Conf/InformationRegisters/Лико_АсинхронныеВызовыВПроведенииДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_АсинхронныеВызовыВПроведенииДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Лико_ДокументСсылкаАсинх</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ЗаписьОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ЗаписьОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ошибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Потоки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УидФЗ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Лико_ОбъектыДляЗаписи</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ТипСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ТипСклада</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СИМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МОЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыВПути</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/CommonModules/Лико_АсинхронныеПроцедуры/Ext/Module.bsl
Процедура Лико_ПроведениеДокументовАсинхронноОбработчик(Источник) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Если ТипЗнч(Источник)=Тип("ДокументОбъект.ПриходныйОрдерНаТовары") И Источник.Склад.Лико_ТипСклада=Перечисления.Лико_ТипСклада.СИМ Тогда
		
		НаборЗаписей = РегистрыСведений.Лико_АсинхронныеВызовыВПроведенииДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Источник.Ссылка);
		Запись=НаборЗаписей.Добавить();
		Запись.Документ=Источник.Ссылка;
		Запись.ДатаНачала=ТекущаяДата();
		НаборЗаписей.Записать();
		НаборПараметров= Новый Массив;
		мОрдеров=Новый Массив;
		мОрдеров.Добавить(Источник.Ссылка);
		НаборПараметров.Добавить(мОрдеров);
		Задание = ФоновыеЗадания.Выполнить("Лико_АсинхронныеПроцедуры.УстановкаДокументаПриходаВОбъектахНоменклатуры", НаборПараметров); 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановкаДокументаПриходаВОбъектахНоменклатуры(мПриходныеОрдера) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Для каждого ПриходныйОрдер Из мПриходныеОрдера Цикл		
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
		мОбъектовНоменклатуры=ПолучитьТзОбъектовНоменклатуры(ПриходныйОрдер);
		Для каждого ОбъектНоменклатуры Из мОбъектовНоменклатуры Цикл
			ОбъектНоменклатурыОбъект=ОбъектНоменклатуры.ПолучитьОбъект();
			ОбъектНоменклатурыОбъект.ПриходныйОрдер=ПриходныйОрдер;
			ОбъектНоменклатурыОбъект.Записать();
		КонецЦикла; 	 	
		НаборЗаписей = РегистрыСведений.Лико_АсинхронныеВызовыВПроведенииДокументов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(ПриходныйОрдер);
		НаборЗаписей.Записать(Истина);
		ЗафиксироватьТранзакцию();
	КонецЦикла;
	
КонецПроцедуры


Функция ПолучитьТзОбъектовНоменклатуры(ПриходныйОрдер)
	УстановитьПривилегированныйРежим(Истина);
	Массив = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриходныйОрдерНаТоварыТовары.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	|ГДЕ
	|	ПриходныйОрдерНаТоварыТовары.Ссылка = &ПриходныйОрдер
	|	И ПриходныйОрдерНаТоварыТовары.Серия.ЯССМ_ОбъектНоменклатуры.Уникальный";
	Запрос.УстановитьПараметр("ПриходныйОрдер",ПриходныйОрдер );
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ОбъектНоменклатуры"); 	
КонецФункции



Процедура ПроведениеВыполнить(МассивСсылок,ИмяОперации="",Параметр="")Экспорт  //+Лико m.shenderov 11.02.2022
	
	Для каждого Ссылка Из МассивСсылок Цикл
		Попытка
			НачатьТранзакцию();
			
			Объект=Ссылка.ПолучитьОбъект();
			Объект.Записать(РежимЗаписиДокумента.Проведение); 
			НаборЗаписей = РегистрыСведений.Лико_ЗаписьОбъектов.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
			НаборЗаписей.Отбор.ИмяОперации.Установить(ИмяОперации);
			НаборЗаписей.Отбор.Параметр.Установить(Параметр);
			НаборЗаписей.Записать(Истина);
			
			ЗафиксироватьТранзакцию();
			
			
		Исключение  
			НаборЗаписей = РегистрыСведений.Лико_ЗаписьОбъектов.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
			НаборЗаписей.Отбор.ИмяОперации.Установить(ИмяОперации);
			НаборЗаписей.Отбор.Параметр.Установить(Параметр);
			НаборЗаписей.Прочитать();
			
			Для каждого Запись Из НаборЗаписей Цикл
				Запись.Ошибка= ОписаниеОшибки()
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			
			
			//ОписаниеОшибки()
		КонецПопытки;
		
	КонецЦикла;	
КонецПроцедуры //-Лико m.shenderov 11.02.2022



Процедура ДляПересчетаВыполнить(МассивСсылок,ИмяОперации="",Параметр="") Экспорт  //+Лико m.shenderov 11.02.2022
	
	Для каждого Ссылка Из МассивСсылок Цикл
		Попытка
			НачатьТранзакцию();
			
			Лико_Планирование.ЗаполнениеПараметровВыпуска(Ссылка, Ложь);

			НаборЗаписей = РегистрыСведений.Лико_ЗаписьОбъектов.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
			НаборЗаписей.Отбор.ИмяОперации.Установить(ИмяОперации);
			НаборЗаписей.Отбор.Параметр.Установить(Параметр);
			НаборЗаписей.Записать(Истина);
			
			ЗафиксироватьТранзакцию();
			
			
		Исключение  
			НаборЗаписей = РегистрыСведений.Лико_ЗаписьОбъектов.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
			НаборЗаписей.Отбор.ИмяОперации.Установить(ИмяОперации);
			НаборЗаписей.Отбор.Параметр.Установить(Параметр);
			НаборЗаписей.Прочитать();
			
			Для каждого Запись Из НаборЗаписей Цикл
				Запись.Ошибка= ОписаниеОшибки()
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			
			
			//ОписаниеОшибки()
		КонецПопытки;
		
	КонецЦикла;	
КонецПроцедуры //-Лико m.shenderov 11.02.2022


  


Процедура ЗаписьВыполнить(МассивСсылок,ИмяОперации="",Параметр="")Экспорт  //+Лико m.shenderov 11.02.2022
	
	Для каждого Ссылка Из МассивСсылок Цикл
		Попытка
			НачатьТранзакцию();
			
			Объект=Ссылка.ПолучитьОбъект();
			Объект.Записать(); 
			НаборЗаписей = РегистрыСведений.Лико_ЗаписьОбъектов.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
			НаборЗаписей.Отбор.ИмяОперации.Установить(ИмяОперации);
			НаборЗаписей.Отбор.Параметр.Установить(Параметр);
			НаборЗаписей.Записать(Истина);
			
			ЗафиксироватьТранзакцию();
			
			
		Исключение  
			НаборЗаписей = РегистрыСведений.Лико_ЗаписьОбъектов.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Ссылка.Установить(Ссылка);
			НаборЗаписей.Отбор.ИмяОперации.Установить(ИмяОперации);
			НаборЗаписей.Отбор.Параметр.Установить(Параметр);
			НаборЗаписей.Прочитать();
			
			Для каждого Запись Из НаборЗаписей Цикл
				Запись.Ошибка= ОписаниеОшибки()
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			
			
			//ОписаниеОшибки()
		КонецПопытки;
		
	КонецЦикла;	
КонецПроцедуры //-Лико m.shenderov 11.02.2022
